## 시계열 데이터
* datetime 오브젝트로 현재 시각 출력

In [1]:
# datetime 라이브러리
from datetime import datetime

In [2]:
# 현재 시각 출력
now1 = datetime.now()
now2 = datetime.today()
print(now1, '\n')
print(now2)

2022-06-03 09:47:55.605986

2022-06-03 09:47:55.606640

In [3]:
# 시간을 직접 입력하여 datetime 오브젝트 생성
t1 = datetime.now()
t2 = datetime(1970,1,1)
t3 = datetime(1970,12,12,13,24,34)

print(t1)
print(t2)
print(t3)

2022-06-03 09:50:48.021142
1970-01-01 00:00:00
1970-12-12 13:24:34

In [4]:
# datetime 오브젝트 연산
diff1 = t1 - t2
diff1

datetime.timedelta(days=19146, seconds=35448, microseconds=21142)

* datetime 오브젝트로 변환 : to_datetime()

In [23]:
# ebola 데이터 집합 가져오기
import pandas as pd
ebola = pd.read_csv('C:\STUDY\StudyPython_kim\day6/country_timeseries.csv')
print(ebola.info())
print(ebola.head(2))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB
None
       Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0  1/5/2015  289        2776.0            NaN            10030.0
1  1/4/2015  288        2775.0            NaN             9780.0

   Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  Cases_Mali  \
0            NaN            NaN                 NaN          NaN         NaN
1            NaN            NaN                 NaN          NaN         NaN

   Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  Deaths_Nigeria  \
0         1786.0             NaN              2977.0             NaN
1         1781.0             NaN              2943.0             NaN

   Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  Deaths_Mali
0             NaN                  NaN           NaN          NaN
1             NaN                  NaN           NaN          NaN

In [24]:
# Date열 자료형을 datetime 오브젝트로 변환
ebola['date_dt'] = pd.to_datetime(ebola['Date'])
print(ebola.info())
print(ebola.head(2))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
 18  date_dt              122 non-null    datetime64[ns]
dtypes: datetime64[ns](1), float64(16), int64(1), object(1)
memory usage: 18.2+ KB
None
       Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
0  1/5/2015  289        2776.0            NaN            10030.0
1  1/4/2015  288        2775.0            NaN             9780.0

   Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  Cases_Mali  \
0            NaN            NaN                 NaN          NaN         NaN
1            NaN            NaN                 NaN          NaN         NaN

   Deaths_Guinea  Deaths_Liberia  Deaths_SierraLeone  Deaths_Nigeria  \
0         1786.0             NaN              2977.0             NaN
1         1781.0             NaN              2943.0             NaN

   Deaths_Senegal  Deaths_UnitedStates  Deaths_Spain  Deaths_Mali    date_dt
0             NaN                  NaN           NaN          NaN 2015-01-05
1             NaN                  NaN           NaN          NaN 2015-01-04

In [25]:
# 시간 형식을 지정하여 datetime 오브젝트 생성
test_df1 = pd.DataFrame({'order_day':['01/01/15','02/01/15','03/01/15']})

test_df1['date_dt1'] = pd.to_datetime(test_df1['order_day'], format='%d/%m/%y')
test_df1['date_dt2'] = pd.to_datetime(test_df1['order_day'], format='%m/%d/%y')
test_df1['date_dt3'] = pd.to_datetime(test_df1['order_day'], format='%y/%m/%d')
test_df1['date_dt4'] = pd.to_datetime(test_df1['order_day'])

test_df1

  order_day   date_dt1   date_dt2   date_dt3   date_dt4
0  01/01/15 2015-01-01 2015-01-01 2001-01-15 2015-01-01
1  02/01/15 2015-01-02 2015-02-01 2002-01-15 2015-02-01
2  03/01/15 2015-01-03 2015-03-01 2003-01-15 2015-03-01

In [26]:
# 시계열 데이터 분리 : strftime()
now = datetime.now()
nowDate = now.strftime('%Y-%m-%d')
nowTime = now.strftime('%H:%M:%S')
nowWeek = now.strftime('%w요일')

print(now, '\n')
print(nowDate, '\n')
print(nowTime, '\n')
print(nowWeek)    # 0~6 : 일~금, 토

2022-06-03 10:35:57.414756

2022-06-03

10:35:57

5요일

* datetime 오브젝트로 변환 : read_csv(parse_dates = ['열이름'])

In [27]:
# 데이터 집합 가져오기
ebola1 = pd.read_csv('C:\STUDY\StudyPython_kim\day6/country_timeseries.csv', parse_dates=['Date'])
ebola1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    datetime64[ns]
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: datetime64[ns](1), float64(16), int64(1)
memory usage: 17.3 KB

In [28]:
print(ebola1['Date'][0].year)
print(ebola1['Date'][0].month)
print(ebola1['Date'][0].day)

2015
1
5

* df 접근자 사용

In [31]:
# 인덱스를 사용하지 않고 df 접근자로 년/월/일 추출하여 저장
ebola['date_df'] = pd.to_datetime(ebola['Date'])

ebola['year'] = ebola['date_dt'].dt.year
ebola['month'] = ebola['date_dt'].dt.month
ebola['day'] = ebola['date_dt'].dt.day

ebola[['Date','date_dt','year','month','day']].head()

         Date    date_dt  year  month  day
0    1/5/2015 2015-01-05  2015      1    5
1    1/4/2015 2015-01-04  2015      1    4
2    1/3/2015 2015-01-03  2015      1    3
3    1/2/2015 2015-01-02  2015      1    2
4  12/31/2014 2014-12-31  2014     12   31

* 에볼라 최초 발병일 계산하기

In [33]:
# 최초 발병일
print(ebola['date_dt'].min())
print(ebola.loc[ebola['date_dt'] == ebola['date_dt'].min()])

2014-03-22 00:00:00
          Date  Day  Cases_Guinea  Cases_Liberia  Cases_SierraLeone  \
121  3/22/2014    0          49.0            NaN                NaN

     Cases_Nigeria  Cases_Senegal  Cases_UnitedStates  Cases_Spain  \
121            NaN            NaN                 NaN          NaN

     Cases_Mali  ...  Deaths_Nigeria  Deaths_Senegal  Deaths_UnitedStates  \
121         NaN  ...             NaN             NaN                  NaN

     Deaths_Spain  Deaths_Mali    date_dt    date_df  year month day
121           NaN          NaN 2014-03-22 2014-03-22  2014     3  22

[1 rows x 23 columns]

In [38]:
# 에볼라 진행 정도 확인
ebola['outbreak_d'] = ebola['date_dt'] - ebola['date_dt'].min()
print(ebola['outbreak_d'])

0     289 days
1     288 days
2     287 days
3     286 days
4     284 days
        ...
117     5 days
118     4 days
119     3 days
120     2 days
121     0 days
Name: outbreak_d, Length: 122, dtype: timedelta64[ns]